bindingExecutionRejected = \u0412\u044B\u043F\u043E\u043B\u043D\u0435\u043D\u0438\u0435 \u043F\u0440\u0438\u0432\u044F\u0437\u043A\u0438 \u043C\u043E\u0434\u0435\u043B\u0438 \u0431\u044B\u043B\u043E \u043E\u0442\u043A\u043B\u043E\u043D\u0435\u043D\u043E. \u041F\u0440\u043E\u0432\u0435\u0440\u044C\u0442\u0435 \u043A\u043E\u043D\u0444\u0438\u0433\u0443\u0440\u0430\u0446\u0438\u044E \u043C\u043E\u0434\u0435\u043B\u0438 \u0438\u043B\u0438 \u043E\u043F\u0442\u0438\u043C\u0438\u0437\u0438\u0440\u0443\u0439\u0442\u0435 \u043D\u0430\u0441\u0442\u0440\u043E\u0439\u043A\u0438 \u043C\u043D\u043E\u0433\u043E\u043F\u043E\u0442\u043E\u0447\u043D\u043E\u0441\u0442\u0438.

bindingsHelp = \u0414\u0430\u043D\u043D\u043E\u0435 \u0441\u0432\u043E\u0439\u0441\u0442\u0432\u043E \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u0443\u0435\u0442\u0441\u044F \u0434\u043B\u044F \u0437\u0430\u0434\u0430\u043D\u0438\u044F \u043F\u0440\u0438\u0432\u044F\u0437\u043E\u043A \u043C\u043E\u0434\u0435\u043B\u0438.

cacheTime = \u0412\u0440\u0435\u043C\u044F \u043A\u0435\u0448\u0438\u0440\u043E\u0432\u0430\u043D\u0438\u044F

cacheTimeHelp = \u041E\u043F\u0440\u0435\u0434\u0435\u043B\u044F\u0435\u0442 \u043C\u0438\u043D\u0438\u043C\u0430\u043B\u044C\u043D\u044B\u0439 \u043F\u0435\u0440\u0438\u043E\u0434 \u0443\u0434\u0430\u043B\u0435\u043D\u043D\u043E\u0433\u043E \u0447\u0442\u0435\u043D\u0438\u044F \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u044F \u043F\u0435\u0440\u0435\u043C\u0435\u043D\u043D\u043E\u0439. \u0415\u0441\u043B\u0438 \u0443\u0434\u0430\u043B\u0435\u043D\u043D\u044B\u0435 \u043A\u043E\u043C\u043F\u043E\u043D\u0435\u043D\u0442\u044B \u043F\u044B\u0442\u0430\u044E\u0442\u0441\u044F \u0441\u0447\u0438\u0442\u0430\u0442\u044C \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435 \u043F\u0435\u0440\u0435\u043C\u0435\u043D\u043D\u043E\u0439 \u0434\u0432\u0430\u0436\u0434\u044B \u0432 \u0442\u0435\u0447\u0435\u043D\u0438\u0435 \u043F\u0435\u0440\u0438\u043E\u0434\u0430 \u043A\u044D\u0448\u0438\u0440\u043E\u0432\u0430\u043D\u0438\u044F, \u0432\u0442\u043E\u0440\u043E\u0439 \u0437\u0430\u043F\u0440\u043E\u0441 \u043D\u0430 \u0447\u0442\u0435\u043D\u0438\u0435 \u0431\u0443\u0434\u0435\u0442 \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u043E\u0432\u0430\u0442\u044C \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435 \u0438\u0437 \u043A\u044D\u0448\u0430. \u041A\u044D\u0448\u0438\u0440\u043E\u0432\u0430\u043D\u0438\u0435 \u043D\u0435 \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u0443\u0435\u0442\u0441\u044F \u0435\u0441\u043B\u0438 \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435 \u043D\u0435 \u0437\u0430\u0434\u0430\u043D\u043E.

conContainerTypeMismatch = \u041D\u0435\u0441\u043E\u043E\u0442\u0432\u0435\u0442\u0441\u0442\u0432\u0438\u0435 \u0442\u0438\u043F\u043E\u0432 \u043A\u043E\u043D\u0442\u0435\u0439\u043D\u0435\u0440\u043E\u0432: \u043E\u0436\u0438\u0434\u0430\u0435\u0442\u0441\u044F {0}, \u043D\u0430\u0439\u0434\u0435\u043D\u043E {1}

conDoesNotExist = \u041A\u043E\u043D\u0442\u0435\u0439\u043D\u0435\u0440\u0430 {0} \u043D\u0435 \u0441\u0443\u0449\u0435\u0441\u0442\u0432\u0443\u0435\u0442

containerName = \u041D\u0430\u0437\u0432\u0430\u043D\u0438\u0435 \u043A\u043E\u043D\u0442\u0435\u0439\u043D\u0435\u0440\u0430

containerPath = \u041F\u0443\u0442\u044C \u043A\u043E\u043D\u0442\u0435\u0439\u043D\u0435\u0440\u0430

containerType = \u0422\u0438\u043F \u043A\u043E\u043D\u0442\u0435\u0439\u043D\u0435\u0440\u0430

containerTypeDescription = \u041E\u043F\u0438\u0441\u0430\u043D\u0438\u0435 \u0442\u0438\u043F\u0430 \u043A\u043E\u043D\u0442\u0435\u0439\u043D\u0435\u0440\u0430

errCompilingFuncImpl = \u041E\u0448\u0438\u0431\u043A\u0430 \u043A\u043E\u043C\u043F\u0438\u043B\u044F\u0446\u0438\u0438 \u0440\u0435\u0430\u043B\u0438\u0437\u0430\u0446\u0438\u0438 \u0444\u0443\u043D\u043A\u0446\u0438\u0438 ''{0}'':

errInstallingModel = \u0423\u0441\u0442\u0430\u043D\u043E\u0432\u043A\u0430 \u043A\u043E\u043D\u0442\u0435\u0439\u043D\u0435\u0440\u0430 \u044D\u043A\u0437\u0435\u043C\u043F\u043B\u044F\u0440\u043D\u043E\u0439 \u043C\u043E\u0434\u0435\u043B\u0438 \u0432 ''{0}'' \u043D\u0435 \u0440\u0430\u0437\u0440\u0435\u0448\u0435\u043D\u0430

errRuleSetCallStackOverflow = \u0426\u0435\u043B\u044C ''{0}'': \u043A\u043E\u043B\u0438\u0447\u0435\u0441\u0442\u0432\u043E \u0440\u0435\u043A\u0443\u0440\u0441\u0438\u0432\u043D\u044B\u0445 \u0432\u044B\u0437\u043E\u0432\u043E\u0432 \u043D\u0430\u0431\u043E\u0440\u043E\u0432 \u043F\u0440\u0430\u0432\u0438\u043B \u043F\u0440\u0435\u0432\u044B\u0441\u0438\u043B\u043E \u043F\u043E\u0440\u043E\u0433\u043E\u0432\u043E\u0435 \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435 ''{1}''; \u043D\u0430\u0431\u043E\u0440 \u043F\u0440\u0430\u0432\u0438\u043B: ''{2}''.

eventDescriptionHelp = \u0414\u0430\u043D\u043D\u043E\u0435 \u043F\u043E\u043B\u0435 \u043F\u0440\u0438\u043C\u0435\u043D\u044F\u0435\u0442\u0441\u044F \u0434\u043B\u044F \u0437\u0430\u0434\u0430\u043D\u0438\u044F \u0443\u0434\u043E\u0431\u043E\u0447\u0438\u0442\u0430\u0435\u043C\u043E\u0433\u043E \u0434\u043B\u044F \u0447\u0435\u043B\u043E\u0432\u0435\u043A\u0430 \u043E\u043F\u0438\u0441\u0430\u043D\u0438\u044F \u0441\u043E\u0431\u044B\u0442\u0438\u044F.

eventFirePermissionsHelp = \u0414\u0430\u043D\u043D\u043E\u0435 \u043F\u043E\u043B\u0435 \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u0443\u0435\u0442\u0441\u044F \u0434\u043B\u044F \u0437\u0430\u0434\u0430\u043D\u0438\u044F \u0443\u0440\u043E\u0432\u043D\u044F \u043F\u0440\u0430\u0432 \u0434\u043E\u0441\u0442\u0443\u043F\u0430 \u0432 \u043A\u043E\u043D\u0442\u0435\u043A\u0441\u0442\u0435 \u043C\u043E\u0434\u0435\u043B\u0438 (\u043B\u0438\u0431\u043E \u043A\u043E\u043D\u0442\u0435\u043A\u0441\u0442, \u043A \u043A\u043E\u0442\u043E\u0440\u043E\u043C\u0443 \u043F\u0440\u0438\u043A\u0440\u0435\u043F\u043B\u0435\u043D\u0430 \u043E\u0442\u043D\u043E\u0441\u0438\u0442\u0435\u043B\u044C\u043D\u0430\u044F \u043C\u043E\u0434\u0435\u043B\u044C, \u043B\u0438\u0431\u043E \u043A\u043E\u043D\u0442\u0435\u043A\u0441\u0442 \u044D\u043A\u0437\u0435\u043C\u043F\u043B\u044F\u0440\u0430 \u044D\u043A\u0437\u0435\u043C\u043F\u043B\u044F\u0440\u043D\u043E\u0439 \u043C\u043E\u0434\u0435\u043B\u0438), \u043D\u0435\u043E\u0431\u0445\u043E\u0434\u0438\u043C\u044B\u0439 \u0434\u043B\u044F \u0433\u0435\u043D\u0435\u0440\u0438\u0440\u043E\u0432\u0430\u043D\u0438\u044F \u0442\u0435\u043A\u0443\u0449\u0435\u0433\u043E \u0441\u043E\u0431\u044B\u0442\u0438\u044F.

eventFormatHelp = \u0414\u0430\u043D\u043D\u043E\u0435 \u043F\u043E\u043B\u0435 \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u0443\u0435\u0442\u0441\u044F \u0434\u043B\u044F \u043E\u043F\u0440\u0435\u0434\u0435\u043B\u0435\u043D\u0438\u044F \u0444\u043E\u0440\u043C\u0430\u0442\u0430 \u0434\u0430\u043D\u043D\u044B\u0445 \u0441\u043E\u0431\u044B\u0442\u0438\u044F.

eventGroupHelp = \u0414\u0430\u043D\u043D\u043E\u0435 \u043F\u043E\u043B\u0435 \u043E\u043F\u0440\u0435\u0434\u0435\u043B\u044F\u0435\u0442 \u043A \u043A\u0430\u043A\u043E\u0439 \u0433\u0440\u0443\u043F\u043F\u0435 \u043E\u0442\u043D\u043E\u0441\u0438\u0442\u0441\u044F \u0442\u0435\u043A\u0443\u0449\u0435\u0435 \u0441\u043E\u0431\u044B\u0442\u0438\u0435. \u041C\u043E\u0436\u0435\u0442 \u0431\u044B\u0442\u044C NULL, \u0435\u0441\u043B\u0438 \u0441\u043E\u0431\u044B\u0442\u0438\u0435 \u043D\u0435 \u0432\u0445\u043E\u0434\u0438\u0442 \u0432 \u043A\u0430\u043A\u0443\u044E-\u043B\u0438\u0431\u043E \u0433\u0440\u0443\u043F\u043F\u0443.

eventHelp = \u0414\u0430\u043D\u043D\u043E\u0435 \u0441\u0432\u043E\u0439\u0441\u0442\u0432\u043E \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u0443\u0435\u0442\u0441\u044F \u0434\u043B\u044F \u043E\u0431\u044A\u044F\u0432\u043B\u0435\u043D\u0438\u044F \u0441\u043E\u0431\u044B\u0442\u0438\u0439 \u0432 \u043C\u043E\u0434\u0435\u043B\u0438.

eventHelpHelp = \u0414\u0430\u043D\u043D\u043E\u0435 \u043F\u043E\u043B\u0435 \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u0443\u0435\u0442\u0441\u044F \u0434\u043B\u044F \u0437\u0430\u0434\u0430\u043D\u0438\u044F \u043F\u043E\u0434\u0440\u043E\u0431\u043D\u043E\u0433\u043E \u043E\u043F\u0438\u0441\u0430\u043D\u0438\u044F \u0441\u043E\u0431\u044B\u0442\u0438\u044F.

eventHistoryStoragePeriodHelp = \u0414\u0430\u043D\u043D\u043E\u0435 \u043F\u043E\u043B\u0435 \u0437\u0430\u0434\u0430\u0435\u0442, \u043A\u0430\u043A \u0434\u043E\u043B\u0433\u043E \u044D\u043A\u0437\u0435\u043C\u043F\u043B\u044F\u0440\u044B \u0442\u0435\u043A\u0443\u0449\u0435\u0433\u043E \u0441\u043E\u0431\u044B\u0442\u0438\u044F \u0431\u0443\u0434\u0443\u0442 \u0445\u0440\u0430\u043D\u0438\u0442\u044C\u0441\u044F \u0432 \u0431\u0430\u0437\u0435 \u0434\u0430\u043D\u043D\u044B\u0445 \u0441\u0435\u0440\u0432\u0435\u0440\u0430. \u041D\u0443\u043B\u0435\u0432\u043E\u0435 \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435 \u043E\u0442\u043A\u043B\u044E\u0447\u0430\u0435\u0442 \u0445\u0440\u0430\u043D\u0435\u043D\u0438\u0435 \u0438\u0441\u0442\u043E\u0440\u0438\u0438 \u0442\u0435\u043A\u0443\u0449\u0435\u0433\u043E \u0441\u043E\u0431\u044B\u0442\u0438\u044F.

eventLevelHelp = \u0414\u0430\u043D\u043D\u043E\u0435 \u043F\u043E\u043B\u0435 \u043E\u043F\u0440\u0435\u0434\u0435\u043B\u044F\u0435\u0442 \u0443\u0440\u043E\u0432\u0435\u043D\u044C \u0441\u043E\u0431\u044B\u0442\u0438\u044F \u043F\u043E \u0443\u043C\u043E\u043B\u0447\u0430\u043D\u0438\u044E.

eventNameHelp = \u0414\u0430\u043D\u043D\u043E\u0435 \u043F\u043E\u043B\u0435 \u043E\u043F\u0440\u0435\u0434\u0435\u043B\u044F\u0435\u0442 \u0438\u043C\u044F \u0441\u043E\u0431\u044B\u0442\u0438\u044F.

eventPermissionsHelp = \u0414\u0430\u043D\u043D\u043E\u0435 \u043F\u043E\u043B\u0435 \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u0443\u0435\u0442\u0441\u044F \u0434\u043B\u044F \u0437\u0430\u0434\u0430\u043D\u0438\u044F \u0443\u0440\u043E\u0432\u043D\u044F \u043F\u0440\u0430\u0432 \u0434\u043E\u0441\u0442\u0443\u043F\u0430 \u0432 \u043A\u043E\u043D\u0442\u0435\u043A\u0441\u0442\u0435 \u043C\u043E\u0434\u0435\u043B\u0438 (\u043B\u0438\u0431\u043E \u043A\u043E\u043D\u0442\u0435\u043A\u0441\u0442, \u043A \u043A\u043E\u0442\u043E\u0440\u043E\u043C\u0443 \u043F\u0440\u0438\u043A\u0440\u0435\u043F\u043B\u0435\u043D\u0430 \u043E\u0442\u043D\u043E\u0441\u0438\u0442\u0435\u043B\u044C\u043D\u0430\u044F \u043C\u043E\u0434\u0435\u043B\u044C, \u043B\u0438\u0431\u043E \u043A\u043E\u043D\u0442\u0435\u043A\u0441\u0442 \u044D\u043A\u0437\u0435\u043C\u043F\u043B\u044F\u0440\u0430 \u044D\u043A\u0437\u0435\u043C\u043F\u043B\u044F\u0440\u043D\u043E\u0439 \u043C\u043E\u0434\u0435\u043B\u0438), \u043D\u0435\u043E\u0431\u0445\u043E\u0434\u0438\u043C\u044B\u0439 \u0434\u043B\u044F \u043F\u043E\u0434\u043F\u0438\u0441\u043A\u0438 \u043D\u0430 \u0441\u043E\u0431\u044B\u0442\u0438\u0435.

foundMultipleRulesToCalculate = \u041D\u0430\u0439\u0434\u0435\u043D\u043E \u043D\u0435\u0441\u043A\u043E\u043B\u044C\u043A\u043E \u0430\u043A\u0442\u0438\u0432\u043D\u044B\u0445 \u043F\u0440\u0430\u0432\u0438\u043B \u0434\u043B\u044F \u0432\u044B\u0447\u0438\u0441\u043B\u0435\u043D\u0438\u044F \u043F\u0435\u0440\u0435\u043C\u0435\u043D\u043D\u043E\u0439:

foundNoRulesToCalculate = \u041D\u0435 \u043D\u0430\u0439\u0434\u0435\u043D\u043E \u043D\u0438 \u043E\u0434\u043D\u043E\u0433\u043E \u0430\u043A\u0442\u0438\u0432\u043D\u043E\u0433\u043E \u043F\u0440\u0430\u0432\u0438\u043B\u0430 \u0434\u043B\u044F \u0432\u044B\u0447\u0438\u0441\u043B\u0435\u043D\u0438\u044F \u043F\u0435\u0440\u0435\u043C\u0435\u043D\u043D\u043E\u0439:

functionConcurrentHelp = \u041E\u043F\u0440\u0435\u0434\u0435\u043B\u044F\u0435\u0442 \u0432\u043E\u0437\u043C\u043E\u0436\u043D\u043E\u0441\u0442\u044C \u043E\u0434\u043D\u043E\u0432\u0440\u0435\u043C\u0435\u043D\u043D\u043E\u0433\u043E \u0432\u044B\u043F\u043E\u043B\u043D\u0435\u043D\u0438\u044F \u043D\u0435\u0441\u043A\u043E\u043B\u044C\u043A\u0438\u0445 \u0432\u044B\u0437\u043E\u0432\u043E\u0432 \u044D\u0442\u043E\u0439 \u0444\u0443\u043D\u043A\u0446\u0438\u0438.

functionDescriptionHelp = \u0414\u0430\u043D\u043D\u043E\u0435 \u043F\u043E\u043B\u0435 \u043F\u0440\u0438\u043C\u0435\u043D\u044F\u0435\u0442\u0441\u044F \u0434\u043B\u044F \u0437\u0430\u0434\u0430\u043D\u0438\u044F \u0443\u0434\u043E\u0431\u043E\u0447\u0438\u0442\u0430\u0435\u043C\u043E\u0433\u043E \u0434\u043B\u044F \u0447\u0435\u043B\u043E\u0432\u0435\u043A\u0430 \u043E\u043F\u0438\u0441\u0430\u043D\u0438\u044F \u0444\u0443\u043D\u043A\u0446\u0438\u0438.

functionExpressionHelp = \u0414\u0430\u043D\u043D\u043E\u0435 \u043F\u043E\u043B\u0435 \u0434\u043E\u0441\u0442\u0443\u043F\u043D\u043E, \u0435\u0441\u043B\u0438 \u0432 \u043F\u043E\u043B\u0435 '\u0422\u0438\u043F' \u0432\u044B\u0431\u0440\u0430\u043D\u043E '\u0412\u044B\u0440\u0430\u0436\u0435\u043D\u0438\u0435'. \u0412\u044B\u0440\u0430\u0436\u0435\u043D\u0438\u0435 \u0431\u0443\u0434\u0435\u0442 \u0432\u044B\u0447\u0438\u0441\u043B\u0435\u043D\u043E \u0432 \u043F\u0440\u043E\u0446\u0435\u0441\u0441\u0435 \u0438\u0441\u043F\u043E\u043B\u043D\u0435\u043D\u0438\u044F \u0444\u0443\u043D\u043A\u0446\u0438\u0438.

functionGroupHelp = \u0414\u0430\u043D\u043D\u043E\u0435 \u043F\u043E\u043B\u0435 \u043E\u043F\u0440\u0435\u0434\u0435\u043B\u044F\u0435\u0442 \u043A \u043A\u0430\u043A\u043E\u0439 \u0433\u0440\u0443\u043F\u043F\u0435 \u043E\u0442\u043D\u043E\u0441\u0438\u0442\u0441\u044F \u0442\u0435\u043A\u0443\u0449\u0430\u044F \u0444\u0443\u043D\u043A\u0446\u0438\u044F. \u041C\u043E\u0436\u0435\u0442 \u0431\u044B\u0442\u044C NULL, \u0435\u0441\u043B\u0438 \u0444\u0443\u043D\u043A\u0446\u0438\u044F \u043D\u0435 \u0432\u0445\u043E\u0434\u0438\u0442 \u0432 \u043A\u0430\u043A\u0443\u044E-\u043B\u0438\u0431\u043E \u0433\u0440\u0443\u043F\u043F\u0443.

functionHelp = \u0414\u0430\u043D\u043D\u043E\u0435 \u0441\u0432\u043E\u0439\u0441\u0442\u0432\u043E \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u0443\u0435\u0442\u0441\u044F \u0434\u043B\u044F \u043E\u0431\u044A\u044F\u0432\u043B\u0435\u043D\u0438\u044F \u0444\u0443\u043D\u043A\u0446\u0438\u0439 \u0432 \u043C\u043E\u0434\u0435\u043B\u0438.

functionHelpHelp = \u0414\u0430\u043D\u043D\u043E\u0435 \u043F\u043E\u043B\u0435 \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u0443\u0435\u0442\u0441\u044F \u0434\u043B\u044F \u0437\u0430\u0434\u0430\u043D\u0438\u044F \u043F\u043E\u0434\u0440\u043E\u0431\u043D\u043E\u0433\u043E \u043E\u043F\u0438\u0441\u0430\u043D\u0438\u044F \u0444\u0443\u043D\u043A\u0446\u0438\u0438.

functionImplementationHelp = \u0414\u0430\u043D\u043D\u043E\u0435 \u043F\u043E\u043B\u0435 \u0434\u043E\u0441\u0442\u0443\u043F\u043D\u043E, \u0435\u0441\u043B\u0438 \u0432 \u043F\u043E\u043B\u0435 '\u0422\u0438\u043F' \u0432\u044B\u0431\u0440\u0430\u043D\u043E '\u041A\u043E\u0434 Java'. \u0418\u0441\u0445\u043E\u0434\u043D\u044B\u0439 \u043A\u043E\u0434 Java \u043A\u043B\u0430\u0441\u0441\u0430 \u0440\u0435\u0430\u043B\u0438\u0437\u0443\u0435\u0442 \u0442\u0435\u043B\u043E \u0444\u0443\u043D\u043A\u0446\u0438\u0438, \u0442.\u0435. \u0434\u0435\u043B\u0430\u0435\u0442 \u0442\u043E, \u0447\u0442\u043E \u0434\u043E\u043B\u0436\u043D\u0430 \u0434\u0435\u043B\u0430\u0442\u044C \u0444\u0443\u043D\u043A\u0446\u0438\u044F.

functionInputFormatHelp = \u0414\u0430\u043D\u043D\u043E\u0435 \u043F\u043E\u043B\u0435 \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u0443\u0435\u0442\u0441\u044F \u0434\u043B\u044F \u043E\u043F\u0440\u0435\u0434\u0435\u043B\u0435\u043D\u0438\u044F \u0444\u043E\u0440\u043C\u0430\u0442\u0430 \u0432\u0432\u043E\u0434\u0430 \u0444\u0443\u043D\u043A\u0446\u0438\u0438.

functionNameHelp = \u0414\u0430\u043D\u043D\u043E\u0435 \u043F\u043E\u043B\u0435 \u043E\u043F\u0440\u0435\u0434\u0435\u043B\u044F\u0435\u0442 \u0438\u043C\u044F \u0444\u0443\u043D\u043A\u0446\u0438\u0438.

functionOutputFormatHelp = \u0414\u0430\u043D\u043D\u043E\u0435 \u043F\u043E\u043B\u0435 \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u0443\u0435\u0442\u0441\u044F \u0434\u043B\u044F \u043E\u043F\u0440\u0435\u0434\u0435\u043B\u0435\u043D\u0438\u044F \u0444\u043E\u0440\u043C\u0430\u0442\u0430 \u0432\u044B\u0432\u043E\u0434\u0430 \u0444\u0443\u043D\u043A\u0446\u0438\u0438.

functionPermissionsHelp = \u0414\u0430\u043D\u043D\u043E\u0435 \u043F\u043E\u043B\u0435 \u043E\u043F\u0440\u0435\u0434\u0435\u043B\u044F\u0435\u0442 \u0443\u0440\u043E\u0432\u0435\u043D\u044C \u043F\u0440\u0430\u0432 \u0434\u043E\u0441\u0442\u0443\u043F\u0430 \u0432 \u043A\u043E\u043D\u0442\u0435\u043A\u0441\u0442\u0435 \u043C\u043E\u0434\u0435\u043B\u0438 (\u043B\u0438\u0431\u043E \u043A\u043E\u043D\u0442\u0435\u043A\u0441\u0442, \u043A \u043A\u043E\u0442\u043E\u0440\u043E\u043C\u0443 \u043F\u0440\u0438\u043A\u0440\u0435\u043F\u043B\u0435\u043D\u0430 \u043E\u0442\u043D\u043E\u0441\u0438\u0442\u0435\u043B\u044C\u043D\u0430\u044F \u043C\u043E\u0434\u0435\u043B\u044C, \u043B\u0438\u0431\u043E \u043A\u043E\u043D\u0442\u0435\u043A\u0441\u0442 \u044D\u043A\u0437\u0435\u043C\u043F\u043B\u044F\u0440\u0430 \u0438\u043D\u0441\u0442\u0430\u043D\u0446\u0438\u0440\u0443\u0435\u043C\u043E\u0439 \u043C\u043E\u0434\u0435\u043B\u0438), \u043D\u0435\u043E\u0431\u0445\u043E\u0434\u0438\u043C\u044B\u0439 \u0434\u043B\u044F \u0432\u044B\u043F\u043E\u043B\u043D\u0435\u043D\u0438\u044F \u0444\u0443\u043D\u043A\u0446\u0438\u0438.

functionQueryHelp = \u042D\u0442\u043E \u043F\u043E\u043B\u0435 \u0434\u043E\u0441\u0442\u0443\u043F\u043D\u043E, \u0435\u0441\u043B\u0438 \u043F\u043E\u043B\u0435 "\u0422\u0438\u043F" \u043D\u0430\u0441\u0442\u0440\u043E\u0435\u043D\u043E \u043D\u0430 \u0417\u0430\u043F\u0440\u043E\u0441. \u0417\u0430\u043F\u0440\u043E\u0441 \u0431\u0443\u0434\u0443\u0442 \u0440\u0430\u0441\u0441\u0447\u0438\u0442\u044B\u0432\u0430\u0442\u044C\u0441\u044F \u0432\u043E \u0432\u0440\u0435\u043C\u044F \u0432\u044B\u043F\u043E\u043B\u043D\u0435\u043D\u0438\u044F \u0444\u0443\u043D\u043A\u0446\u0438\u0438.

functionTypeHelp = \u0414\u0430\u043D\u043D\u043E\u0435 \u043F\u043E\u043B\u0435 \u043E\u043F\u0440\u0435\u0434\u0435\u043B\u044F\u0435\u0442 \u0442\u0438\u043F \u0440\u0435\u0430\u043B\u0438\u0437\u0430\u0446\u0438\u0438 \u0444\u0443\u043D\u043A\u0446\u0438\u0438.

historyStoragePeriod = \u041F\u0435\u0440\u0438\u043E\u0434 \u0445\u0440\u0430\u043D\u0435\u043D\u0438\u044F \u0438\u0441\u0442\u043E\u0440\u0438\u0438

instantiable = \u042D\u043A\u0437\u0435\u043C\u043F\u043B\u044F\u0440\u043D\u0430\u044F

javaCode = \u041A\u043E\u0434 \u043D\u0430 Java

modelEvents = \u0421\u043E\u0431\u044B\u0442\u0438\u044F \u043C\u043E\u0434\u0435\u043B\u0438

modelFunctions = \u0424\u0443\u043D\u043A\u0446\u0438\u0438 \u043C\u043E\u0434\u0435\u043B\u0438

modelGroups = \u0413\u0440\u0443\u043F\u043F\u044B \u043C\u043E\u0434\u0435\u043B\u0435\u0439

modelVariables = \u041F\u0435\u0440\u0435\u043C\u0435\u043D\u043D\u044B\u0435 \u043C\u043E\u0434\u0435\u043B\u0438

models = \u041C\u043E\u0434\u0435\u043B\u0438

moveToContainer = \u041F\u0435\u0440\u0435\u043C\u0435\u0441\u0442\u0438\u0442\u044C \u0432 \u043A\u043E\u043D\u0442\u0435\u0439\u043D\u0435\u0440

noPluginErr = \u041D\u0435\u0432\u043E\u0437\u043C\u043E\u0436\u043D\u043E \u0432\u044B\u043F\u043E\u043B\u043D\u0438\u0442\u044C \u043E\u043F\u0435\u0440\u0430\u0446\u0438\u044E. \u041E\u0442\u0441\u0443\u0442\u0441\u0442\u0432\u0443\u0435\u0442 \u0442\u0440\u0435\u0431\u0443\u0435\u043C\u044B\u0439 \u043F\u043B\u0430\u0433\u0438\u043D

objectNamingExpression = \u0412\u044B\u0440\u0430\u0436\u0435\u043D\u0438\u0435 \u0438\u043C\u0435\u043D\u043E\u0432\u0430\u043D\u0438\u044F \u043E\u0431\u044A\u0435\u043A\u0442\u0430

objectType = \u0422\u0438\u043F \u043E\u0431\u044A\u0435\u043A\u0442\u0430

objectTypeDescription = \u041E\u043F\u0438\u0441\u0430\u043D\u0438\u0435 \u0442\u0438\u043F\u0430 \u043E\u0431\u044A\u0435\u043A\u0442\u0430

propertiesAdvancedBindingSettingsHelp = \u0420\u0430\u0441\u0448\u0438\u0440\u0435\u043D\u043D\u044B\u0435 \u043D\u0430\u0441\u0442\u0440\u043E\u0439\u043A\u0438 \u043F\u0440\u0438\u0432\u044F\u0437\u043E\u043A

propertiesConValidityExpressionHelp = \u0414\u0435\u0439\u0441\u0442\u0432\u0443\u0435\u0442 \u043F\u043E-\u0440\u0430\u0437\u043D\u043E\u043C\u0443 \u0432 \u0437\u0430\u0432\u0438\u0441\u0438\u043C\u043E\u0441\u0442\u0438 \u043E\u0442 \u0442\u0438\u043F\u0430 \u043C\u043E\u0434\u0435\u043B\u0438, \u043E\u0442\u043D\u043E\u0441\u0438\u0442\u0435\u043B\u044C\u043D\u043E\u0439 \u0438\u043B\u0438 \u0438\u043D\u0441\u0442\u0430\u043D\u0446\u0438\u0440\u0443\u0435\u043C\u043E\u0439. \u0412 \u0441\u043B\u0443\u0447\u0430\u0435 \u043E\u0442\u043D\u043E\u0441\u0438\u0442\u0435\u043B\u044C\u043D\u043E\u0439 \u043C\u043E\u0434\u0435\u043B\u0438 \u043E\u043F\u0440\u0435\u0434\u0435\u043B\u044F\u0435\u0442, \u043A \u043A\u0430\u043A\u043E\u043C\u0443(\u0438\u043C) \u043A\u043E\u043D\u0442\u0435\u043A\u0441\u0442\u0443(\u0430\u043C) \u0434\u043E\u043B\u0436\u043D\u0430 \u043F\u0440\u0438\u043A\u0440\u0435\u043F\u043B\u044F\u0442\u044C\u0441\u044F \u043C\u043E\u0434\u0435\u043B\u044C. \u0412 \u0441\u043B\u0443\u0447\u0430\u0435 \u0438\u043D\u0441\u0442\u0430\u043D\u0446\u0438\u0440\u0443\u0435\u043C\u043E\u0439 \u043C\u043E\u0434\u0435\u043B\u0438 \u043E\u043F\u0440\u0435\u0434\u0435\u043B\u044F\u0435\u0442, \u043A \u043A\u0430\u043A\u043E\u043C\u0443(\u0438\u043C) \u043A\u043E\u043D\u0442\u0435\u043A\u0441\u0442\u0443(\u0430\u043C) \u0434\u043E\u043B\u0436\u043D\u044B \u043F\u0440\u0438\u043A\u0440\u0435\u043F\u043B\u044F\u0442\u044C\u0441\u044F \u043A\u043E\u043D\u0442\u0435\u0439\u043D\u0435\u0440\u044B \u044D\u043A\u0437\u0435\u043C\u043F\u043B\u044F\u0440\u043E\u0432 \u043C\u043E\u0434\u0435\u043B\u0438.

propertiesConValidityListenersHelp = \u0421\u043F\u0438\u0441\u043E\u043A \u043C\u0430\u0441\u043E\u043A \u043A\u043E\u043D\u0442\u0435\u043A\u0441\u0442\u0430 \u0438 \u0438\u043C\u0435\u043D \u0441\u043E\u0431\u044B\u0442\u0438\u0439. \u0415\u0441\u043B\u0438 \u0441\u043E\u0431\u044B\u0442\u0438\u0435, \u043E\u043F\u0440\u0435\u0434\u0435\u043B\u0435\u043D\u043D\u043E\u0435 \u043F\u043E\u043B\u0435\u043C '\u0421\u043E\u0431\u044B\u0442\u0438\u0435' \u044D\u0442\u043E\u0439 \u0442\u0430\u0431\u043B\u0438\u0446\u044B, \u043F\u0440\u043E\u0438\u0441\u0445\u043E\u0434\u0438\u0442 \u0432 \u043B\u044E\u0431\u043E\u043C \u043A\u043E\u043D\u0442\u0435\u043A\u0441\u0442\u0435, \u043A\u043E\u0442\u043E\u0440\u044B\u0439 \u0441\u043E\u043E\u0442\u0432\u0435\u0442\u0441\u0442\u0432\u0443\u0435\u0442 \u043C\u0430\u0441\u043A\u0435, \u043E\u043F\u0440\u0435\u0434\u0435\u043B\u0435\u043D\u043D\u043E\u0439 \u043F\u043E\u043B\u0435\u043C '\u041C\u0430\u0441\u043A\u0430' \u0432 \u0442\u043E\u0439 \u0436\u0435 \u0437\u0430\u043F\u0438\u0441\u0438, \u0432\u044B\u0440\u0430\u0436\u0435\u043D\u0438\u0435 \u043F\u0440\u0438\u0433\u043E\u0434\u043D\u043E\u0441\u0442\u0438 \u0434\u043B\u044F \u044D\u0442\u043E\u0433\u043E \u043A\u043E\u043D\u0442\u0435\u043A\u0441\u0442\u0430 \u043F\u0435\u0440\u0435\u0441\u0447\u0438\u0442\u044B\u0432\u0430\u0435\u0442\u0441\u044F. \u042D\u0442\u043E \u043F\u043E\u0437\u0432\u043E\u043B\u044F\u0435\u0442 \u0441\u0434\u0435\u043B\u0430\u0442\u044C \u043C\u043E\u0434\u0435\u043B\u044C \u043F\u0440\u0438\u0433\u043E\u0434\u043D\u043E\u0439 \u0438 \u043D\u0435\u043F\u0440\u0438\u0433\u043E\u0434\u043D\u043E\u0439 \u0434\u043B\u044F \u043E\u043F\u0440\u0435\u0434\u0435\u043B\u0435\u043D\u043D\u043E\u0433\u043E \u043A\u043E\u043D\u0442\u0435\u043A\u0441\u0442\u0430, \u0435\u0441\u043B\u0438 \u043F\u0440\u043E\u0438\u0441\u0445\u043E\u0434\u044F\u0442 \u043A\u0430\u043A\u0438\u0435-\u043B\u0438\u0431\u043E \u0438\u0437\u043C\u0435\u043D\u0435\u043D\u0438\u044F.

propertiesContainerNameHelp = \u0414\u0430\u043D\u043D\u0430\u044F \u043D\u0430\u0441\u0442\u0440\u043E\u0439\u043A\u0430 \u043E\u043F\u0440\u0435\u0434\u0435\u043B\u044F\u0435\u0442 \u043A\u043E\u043D\u0442\u0435\u043A\u0441\u0442\u043D\u043E\u0435 \u0438\u043C\u044F \u043A\u043E\u043D\u0442\u0435\u0439\u043D\u0435\u0440\u043E\u0432 \u043C\u043E\u0434\u0435\u043B\u0438. \u041E\u043D\u043E \u0434\u043E\u043B\u0436\u043D\u043E \u0443\u0434\u043E\u0432\u043B\u0435\u0442\u0432\u043E\u0440\u044F\u0442\u044C \u0441\u043E\u0433\u043B\u0430\u0448\u0435\u043D\u0438\u044F\u043C \u043F\u043E \u043D\u0430\u0438\u043C\u0435\u043D\u043E\u0432\u0430\u043D\u0438\u044E \u043A\u043E\u043D\u0442\u0435\u043A\u0441\u0442\u0430.

propertiesContainerTypeDescriptionHelp = \u0414\u0430\u043D\u043D\u0430\u044F \u043E\u043F\u0446\u0438\u044F \u043E\u043F\u0440\u0435\u0434\u0435\u043B\u044F\u0435\u0442 \u0443\u0434\u043E\u0431\u043E\u0447\u0438\u0442\u0430\u0435\u043C\u043E\u0435 \u0434\u043B\u044F \u0447\u0435\u043B\u043E\u0432\u0435\u043A\u0430 \u043E\u043F\u0438\u0441\u0430\u043D\u0438\u0435 \u0442\u0438\u043F\u0430 \u043A\u043E\u043D\u0442\u0435\u043A\u0441\u0442\u0430 \u043A\u043E\u043D\u0442\u0435\u0439\u043D\u0435\u0440\u0430 \u043C\u043E\u0434\u0435\u043B\u0438.

propertiesContainerTypeHelp = \u0414\u0430\u043D\u043D\u0430\u044F \u043D\u0430\u0441\u0442\u0440\u043E\u0439\u043A\u0430 \u043E\u043F\u0440\u0435\u0434\u0435\u043B\u044F\u0435\u0442 \u0442\u0438\u043F \u043A\u043E\u043D\u0442\u0435\u043A\u0441\u0442\u0430 \u043A\u043E\u043D\u0442\u0435\u0439\u043D\u0435\u0440\u043E\u0432 \u043C\u043E\u0434\u0435\u043B\u0438. \u0421\u0442\u0440\u043E\u043A\u0430 \u0442\u0438\u043F\u0430 \u043C\u043E\u0436\u0435\u0442 \u0441\u043E\u0434\u0435\u0440\u0436\u0430\u0442\u044C \u0442\u043E\u043B\u044C\u043A\u043E \u0430\u043D\u0433\u043B\u0438\u0439\u0441\u043A\u0438\u0435 \u0431\u0443\u043A\u0432\u044B, \u0447\u0438\u0441\u043B\u0430 \u0438 \u043D\u0438\u0436\u043D\u0438\u0435 \u043F\u043E\u0434\u0447\u0435\u0440\u043A\u0438\u0432\u0430\u043D\u0438\u044F.

propertiesDefaultContextHelp = \u041A\u043E\u043D\u0442\u0435\u043A\u0441\u0442 \u043F\u043E \u0443\u043C\u043E\u043B\u0447\u0430\u043D\u0438\u044E, \u043A\u043E\u0442\u043E\u0440\u044B\u0439 \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u0443\u0435\u0442\u0441\u044F \u0432\u043E \u0432\u0441\u0435\u0445 \u0432\u043D\u0443\u0442\u0440\u0435\u043D\u043D\u0438\u0445 \u0432\u044B\u0440\u0430\u0436\u0435\u043D\u0438\u044F\u0445.

propertiesDescriptionHelp = \u041E\u043F\u0438\u0441\u0430\u043D\u0438\u0435 \u043A\u043E\u043D\u0442\u0435\u043A\u0441\u0442\u0430 \u043C\u043E\u0434\u0435\u043B\u0438 (\u0442\u0435\u043A\u0441\u0442 \u043E\u0442\u043E\u0431\u0440\u0430\u0436\u0430\u0435\u0442\u0441\u044F \u0432 \u0434\u0435\u0440\u0435\u0432\u0435 \u043A\u043E\u043D\u0442\u0435\u043A\u0441\u0442\u043E\u0432).

propertiesEnabledHelp = \u0415\u0441\u043B\u0438 \u044D\u0442\u043E\u0442 \u0444\u043B\u0430\u0433 \u0441\u043D\u044F\u0442, \u043C\u043E\u0434\u0435\u043B\u044C \u0434\u0435\u0430\u043A\u0442\u0438\u0432\u0438\u0440\u0443\u0435\u0442\u0441\u044F \u0438 \u043D\u0435 \u043E\u0431\u0440\u0430\u0431\u0430\u0442\u044B\u0432\u0430\u0435\u0442 \u043A\u0430\u043A\u0438\u0435-\u043B\u0438\u0431\u043E \u0430\u043A\u0442\u0438\u0432\u043D\u044B\u0435 \u043F\u0440\u0438\u0432\u044F\u0437\u043A\u0438. \u041F\u0440\u0438 \u044D\u0442\u043E\u043C \u0432\u0441\u0435 \u043E\u043F\u0440\u0435\u0434\u0435\u043B\u0435\u043D\u0438\u044F \u043F\u0435\u0440\u0435\u043C\u0435\u043D\u043D\u044B\u0445, \u0444\u0443\u043D\u043A\u0446\u0438\u0439 \u0438 \u0441\u043E\u0431\u044B\u0442\u0438\u0439, \u0434\u043E\u0431\u0430\u0432\u043B\u0435\u043D\u043D\u044B\u0435 \u044D\u0442\u043E\u0439 \u043C\u043E\u0434\u0435\u043B\u044C\u044E, \u043E\u0441\u0442\u0430\u044E\u0442\u0441\u044F \u0434\u043E\u0441\u0442\u0443\u043F\u043D\u044B, \u0435\u0441\u043B\u0438 \u043C\u043E\u0434\u0435\u043B\u044C \u0434\u0435\u0430\u043A\u0442\u0438\u0432\u0438\u0440\u043E\u0432\u0430\u043D\u0430. \u042D\u043A\u0437\u0435\u043C\u043F\u043B\u044F\u0440\u044B \u0434\u0435\u0430\u043A\u0442\u0438\u0432\u0438\u0440\u043E\u0432\u0430\u043D\u043D\u043E\u0439 \u044D\u043A\u0437\u0435\u043C\u043F\u043B\u044F\u0440\u043D\u043E\u0439 \u043C\u043E\u0434\u0435\u043B\u0438 \u0442\u0430\u043A\u0436\u0435 \u043D\u0435 \u0441\u043A\u0440\u044B\u0432\u0430\u044E\u0442\u0441\u044F \u0438 \u043D\u0435 \u0443\u0431\u0438\u0440\u0430\u044E\u0442\u0441\u044F \u0438\u0437 \u0434\u0435\u0440\u0435\u0432\u0430 \u043A\u043E\u043D\u0442\u0435\u043A\u0441\u0442\u043E\u0432 \u0441\u0435\u0440\u0432\u0435\u0440\u0430.

propertiesHelp = \u0414\u0430\u043D\u043D\u043E\u0435 \u0441\u0432\u043E\u0439\u0441\u0442\u0432\u043E \u043E\u043F\u0440\u0435\u0434\u0435\u043B\u044F\u0435\u0442 \u043E\u0431\u0449\u0438\u0435 \u043D\u0430\u0441\u0442\u0440\u043E\u0439\u043A\u0438 \u043C\u043E\u0434\u0435\u043B\u0438.

propertiesInstantiableModelSettingsGroupHelp = \u041D\u0430\u0441\u0442\u0440\u043E\u0439\u043A\u0438 \u044D\u043A\u0437\u0435\u043C\u043F\u043B\u044F\u0440\u043D\u043E\u0439 \u043C\u043E\u0434\u0435\u043B\u0438

propertiesLogBindingsExecutionHelp = \u0414\u0430\u043D\u043D\u0430\u044F \u043D\u0430\u0441\u0442\u0440\u043E\u0439\u043A\u0430 \u0432\u043A\u043B\u044E\u0447\u0430\u0435\u0442 \u0438 \u043E\u0442\u043A\u043B\u044E\u0447\u0430\u0435\u0442 \u0436\u0443\u0440\u043D\u0430\u043B\u0438\u0440\u043E\u0432\u0430\u043D\u0438\u0435 \u0432\u0441\u0435\u0445 \u0432\u044B\u043F\u043E\u043B\u043D\u0435\u043D\u043D\u044B\u0445 \u043F\u0440\u0438\u0432\u044F\u0437\u043E\u043A.

propertiesMaximumBindingQueueLengthHelp = \u0414\u0430\u043D\u043D\u0430\u044F \u043D\u0430\u0441\u0442\u0440\u043E\u0439\u043A\u0430 \u043E\u043F\u0440\u0435\u0434\u0435\u043B\u044F\u0435\u0442, \u0441\u043A\u043E\u043B\u044C\u043A\u043E \u043D\u0435\u043E\u0431\u0440\u0430\u0431\u043E\u0442\u0430\u043D\u043D\u044B\u0445 \u043E\u043F\u0435\u0440\u0430\u0446\u0438\u0439 \u043F\u0440\u0438\u0432\u044F\u0437\u043A\u0438 \u043C\u043E\u0436\u043D\u043E \u043F\u043E\u0441\u0442\u0430\u0432\u0438\u0442\u044C \u0432 \u043E\u0447\u0435\u0440\u0435\u0434\u044C, \u043F\u0440\u0435\u0436\u0434\u0435 \u0447\u0435\u043C \u0440\u0430\u0437\u043C\u0435\u0440 \u043F\u0443\u043B\u0430 \u043F\u043E\u0442\u043E\u043A\u043E\u0432 \u043C\u043E\u0434\u0435\u043B\u0438 \u043F\u0440\u0435\u0432\u044B\u0441\u0438\u0442 \u0435\u0435 \u0440\u0430\u0437\u043C\u0435\u0440 \u044F\u0434\u0440\u0430 \u043E\u0442\u043D\u043E\u0441\u0438\u0442\u0435\u043B\u044C\u043D\u043E \u043C\u0430\u043A\u0441\u0438\u043C\u0430\u043B\u044C\u043D\u043E\u0433\u043E \u0440\u0430\u0437\u043C\u0435\u0440\u0430.

propertiesMaximumConcurrentBindingsHelp = \u0414\u0430\u043D\u043D\u0430\u044F \u043D\u0430\u0441\u0442\u0440\u043E\u0439\u043A\u0430 \u043E\u043F\u0440\u0435\u0434\u0435\u043B\u044F\u0435\u0442 \u043C\u0430\u043A\u0441\u0438\u043C\u0430\u043B\u044C\u043D\u044B\u0439 \u0440\u0430\u0437\u043C\u0435\u0440 \u043F\u0443\u043B\u0430 \u043F\u043E\u0442\u043E\u043A\u043E\u0432 \u043C\u043E\u0434\u0435\u043B\u0438, \u0442.\u0435. \u043A\u043E\u043B\u0438\u0447\u0435\u0441\u0442\u0432\u043E \u043E\u0434\u043D\u043E\u0432\u0440\u0435\u043C\u0435\u043D\u043D\u043E \u043E\u0431\u0440\u0430\u0431\u0430\u0442\u044B\u0432\u0430\u0435\u043C\u044B\u0445 \u043F\u0440\u0438\u0432\u044F\u0437\u043E\u043A, \u0440\u0430\u0437\u0440\u0435\u0448\u0435\u043D\u043D\u044B\u0445 \u0432 \u0441\u043B\u0443\u0447\u0430\u0435 \u043F\u0435\u0440\u0435\u043F\u043E\u043B\u043D\u0435\u043D\u0438\u044F \u043E\u0447\u0435\u0440\u0435\u0434\u0438 \u043F\u0440\u0438\u0432\u044F\u0437\u043E\u043A.

propertiesNameHelp = \u0418\u043C\u044F \u043A\u043E\u043D\u0442\u0435\u043A\u0441\u0442\u0430 \u043C\u043E\u0434\u0435\u043B\u0438. \u041E\u043D\u043E \u0434\u043E\u043B\u0436\u043D\u043E \u0443\u0434\u043E\u0432\u043B\u0435\u0442\u0432\u043E\u0440\u044F\u0442\u044C \u0441\u043E\u0433\u043B\u0430\u0448\u0435\u043D\u0438\u044F\u043C \u043F\u043E \u043D\u0430\u0438\u043C\u0435\u043D\u043E\u0432\u0430\u043D\u0438\u044E \u043A\u043E\u043D\u0442\u0435\u043A\u0441\u0442\u0430. \u0418\u043C\u044F \u043D\u0435\u043E\u0431\u0445\u043E\u0434\u0438\u043C\u043E \u0434\u043B\u044F \u0441\u0441\u044B\u043B\u043A\u0438 \u043D\u0430 \u044D\u0442\u0443 \u043C\u043E\u0434\u0435\u043B\u044C \u0438\u0437 \u0434\u0440\u0443\u0433\u0438\u0445 \u0447\u0430\u0441\u0442\u0435\u0439 \u0441\u0438\u0441\u0442\u0435\u043C\u044B.

propertiesNormalConcurrentBindingsHelp = \u0414\u0430\u043D\u043D\u0430\u044F \u043D\u0430\u0441\u0442\u0440\u043E\u0439\u043A\u0430 \u043E\u043F\u0440\u0435\u0434\u0435\u043B\u044F\u0435\u0442 \u0440\u0430\u0437\u043C\u0435\u0440 \u044F\u0434\u0440\u0430 \u043F\u0443\u043B\u0430 \u043F\u043E\u0442\u043E\u043A\u043E\u0432 \u043C\u043E\u0434\u0435\u043B\u0438, \u0442.\u0435. \u0441\u0442\u0430\u043D\u0434\u0430\u0440\u0442\u043D\u043E\u0435 \u043A\u043E\u043B\u0438\u0447\u0435\u0441\u0442\u0432\u043E \u043F\u0440\u0438\u0432\u044F\u0437\u043E\u043A, \u043A\u043E\u0442\u043E\u0440\u044B\u0435 \u043E\u0431\u0440\u0430\u0431\u0430\u0442\u044B\u0432\u0430\u044E\u0442\u0441\u044F \u043E\u0434\u043D\u043E\u0432\u0440\u0435\u043C\u0435\u043D\u043D\u043E.

propertiesObjectNamingExpressionHelp = \u0414\u0430\u043D\u043D\u0430\u044F \u043D\u0430\u0441\u0442\u0440\u043E\u0439\u043A\u0430 \u043F\u0440\u0438\u043C\u0435\u043D\u044F\u0435\u0442\u0441\u044F \u0442\u043E\u043B\u044C\u043A\u043E \u0434\u043B\u044F \u044D\u043A\u0437\u0435\u043C\u043F\u043B\u044F\u0440\u043D\u044B\u0445 \u043C\u043E\u0434\u0435\u043B\u0435\u0439. \u041E\u043D\u0430 \u043E\u043F\u0440\u0435\u0434\u0435\u043B\u044F\u0435\u0442 \u043E\u043F\u0438\u0441\u0430\u043D\u0438\u0435 \u043A\u043E\u043D\u0442\u0435\u043A\u0441\u0442\u0430 \u044D\u043A\u0437\u0435\u043C\u043F\u043B\u044F\u0440\u0430 \u043C\u043E\u0434\u0435\u043B\u0438.

propertiesObjectTypeDescriptionHelp = \u0414\u0430\u043D\u043D\u0430\u044F \u043D\u0430\u0441\u0442\u0440\u043E\u0439\u043A\u0430 \u043F\u0440\u0438\u043C\u0435\u043D\u044F\u0435\u0442\u0441\u044F \u0442\u043E\u043B\u044C\u043A\u043E \u0434\u043B\u044F \u044D\u043A\u0437\u0435\u043C\u043F\u043B\u044F\u0440\u043D\u044B\u0445 \u043C\u043E\u0434\u0435\u043B\u0435\u0439. \u041E\u043D\u0430 \u043E\u043F\u0440\u0435\u0434\u0435\u043B\u044F\u0435\u0442 \u0443\u0434\u043E\u0431\u043E\u0447\u0438\u0442\u0430\u0435\u043C\u043E\u0435 \u0434\u043B\u044F \u0447\u0435\u043B\u043E\u0432\u0435\u043A\u0430 \u043E\u043F\u0438\u0441\u0430\u043D\u0438\u0435 \u0442\u0438\u043F\u0430 \u043A\u043E\u043D\u0442\u0435\u043A\u0441\u0442\u0430 \u044D\u043A\u0437\u0435\u043C\u043F\u043B\u044F\u0440\u0430 \u043C\u043E\u0434\u0435\u043B\u0438.

propertiesObjectTypeHelp = \u0414\u0430\u043D\u043D\u0430\u044F \u043D\u0430\u0441\u0442\u0440\u043E\u0439\u043A\u0430 \u043F\u0440\u0438\u043C\u0435\u043D\u044F\u0435\u0442\u0441\u044F \u0442\u043E\u043B\u044C\u043A\u043E \u0434\u043B\u044F \u044D\u043A\u0437\u0435\u043C\u043F\u043B\u044F\u0440\u043D\u044B\u0445 \u043C\u043E\u0434\u0435\u043B\u0435\u0439. \u041E\u043D\u0430 \u043E\u043F\u0440\u0435\u0434\u0435\u043B\u044F\u0435\u0442 \u0442\u0438\u043F \u043A\u043E\u043D\u0442\u0435\u043A\u0441\u0442\u0430 \u044D\u043A\u0437\u0435\u043C\u043F\u043B\u044F\u0440\u043E\u0432 \u043C\u043E\u0434\u0435\u043B\u0438. \u0421\u0442\u0440\u043E\u043A\u0430 \u0442\u0438\u043F\u0430 \u043C\u043E\u0436\u0435\u0442 \u0441\u043E\u0434\u0435\u0440\u0436\u0430\u0442\u044C \u0442\u043E\u043B\u044C\u043A\u043E \u0430\u043D\u0433\u043B\u0438\u0439\u0441\u043A\u0438\u0435 \u0431\u0443\u043A\u0432\u044B, \u0447\u0438\u0441\u043B\u0430 \u0438 \u043D\u0438\u0436\u043D\u0438\u0435 \u043F\u043E\u0434\u0447\u0435\u0440\u043A\u0438\u0432\u0430\u043D\u0438\u044F.

propertiesRuleSetCallStackDepthThresholdHelp = \u0412 \u044D\u0442\u043E\u0439 \u043C\u043E\u0434\u0435\u043B\u0438 \u0433\u0435\u043D\u0435\u0440\u0438\u0440\u0443\u0435\u0442\u0441\u044F \u0441\u043E\u0431\u044B\u0442\u0438\u0435 (\u0430 \u0442\u0430\u043A\u0436\u0435 \u0434\u0435\u043B\u0430\u0435\u0442\u0441\u044F \u0437\u0430\u043F\u0438\u0441\u044C \u0432 \u0441\u0435\u0440\u0432\u0435\u0440\u043D\u043E\u043C \u043B\u043E\u0433\u0435), \u0435\u0441\u043B\u0438 \u0433\u043B\u0443\u0431\u0438\u043D\u0430 \u0441\u0442\u0435\u043A\u0430 \u0432\u044B\u0437\u043E\u0432\u043E\u0432 \u043D\u0430\u0431\u043E\u0440\u043E\u0432 \u043F\u0440\u0430\u0432\u0438\u043B \u043F\u0440\u0435\u0432\u044B\u0448\u0430\u0435\u0442 \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435, \u0443\u043A\u0430\u0437\u0430\u043D\u043D\u043E\u0435 \u0432 \u0434\u0430\u043D\u043D\u043E\u0439 \u043D\u0430\u0441\u0442\u0440\u043E\u0439\u043A\u0435. \u042D\u0442\u043E \u043C\u043E\u0436\u0435\u0442 \u043F\u0440\u043E\u0438\u0437\u043E\u0439\u0442\u0438 \u0432 \u0441\u043B\u0443\u0447\u0430\u0435, \u0435\u0441\u043B\u0438 \u043D\u0430\u0431\u043E\u0440 \u043F\u0440\u0430\u0432\u0438\u043B \u0432\u044B\u0437\u044B\u0432\u0430\u0435\u0442\u0441\u044F \u0440\u0435\u043A\u0443\u0440\u0441\u0438\u0432\u043D\u043E.

propertiesTypeHelp = \u0414\u0430\u043D\u043D\u0430\u044F \u043D\u0430\u0441\u0442\u0440\u043E\u0439\u043A\u0430 \u043E\u043F\u0440\u0435\u0434\u0435\u043B\u044F\u0435\u0442 \u0442\u0438\u043F \u043C\u043E\u0434\u0435\u043B\u0438: \u041E\u0442\u043D\u043E\u0441\u0438\u0442\u0435\u043B\u044C\u043D\u0430\u044F, \u0410\u0431\u0441\u043E\u043B\u044E\u0442\u043D\u0430\u044F \u0438\u043B\u0438 \u042D\u043A\u0437\u0435\u043C\u043F\u043B\u044F\u0440\u043D\u0430\u044F.

propertiesValidityGroupHelp = \u041F\u0440\u0438\u0433\u043E\u0434\u043D\u043E\u0441\u0442\u044C

rule = \u041F\u0440\u0430\u0432\u0438\u043B\u043E

ruleSet = \u041D\u0430\u0431\u043E\u0440 \u043F\u0440\u0430\u0432\u0438\u043B

ruleSetCallStackDepthThreshold = \u041F\u043E\u0440\u043E\u0433 \u0433\u043B\u0443\u0431\u0438\u043D\u044B \u0441\u0442\u0435\u043A\u0430 \u0432\u044B\u0437\u043E\u0432\u043E\u0432 \u043D\u0430\u0431\u043E\u0440\u043E\u0432 \u043F\u0440\u0430\u0432\u0438\u043B

ruleSetDescriptionHelp = \u0414\u0430\u043D\u043D\u043E\u0435 \u043F\u043E\u043B\u0435 \u043E\u043F\u0440\u0435\u0434\u0435\u043B\u044F\u0435\u0442 \u0443\u0434\u043E\u0431\u043E\u0447\u0438\u0442\u0430\u0435\u043C\u043E\u0435 \u0434\u043B\u044F \u0447\u0435\u043B\u043E\u0432\u0435\u043A\u0430 \u043E\u043F\u0438\u0441\u0430\u043D\u0438\u0435 \u043D\u0430\u0431\u043E\u0440\u0430 \u043F\u0440\u0430\u0432\u0438\u043B.

ruleSetEmpty = \u041F\u0443\u0441\u0442\u043E\u0439 \u043D\u0430\u0431\u043E\u0440 \u043F\u0440\u0430\u0432\u0438\u043B

ruleSetNameHelp = \u0414\u0430\u043D\u043D\u043E\u0435 \u043F\u043E\u043B\u0435 \u043E\u043F\u0440\u0435\u0434\u0435\u043B\u044F\u0435\u0442 \u0438\u043C\u044F \u043D\u0430\u0431\u043E\u0440\u0430 \u043F\u0440\u0430\u0432\u0438\u043B. \u0418\u0441\u043F\u043E\u043B\u044C\u0437\u0443\u0435\u0442\u0441\u044F \u0434\u043B\u044F \u0441\u0441\u044B\u043B\u043A\u0438 \u043D\u0430 \u044D\u0442\u043E\u0442 \u043D\u0430\u0431\u043E\u0440 \u0438\u0437 \u0434\u0440\u0443\u0433\u0438\u0445 \u043A\u043E\u043C\u043F\u043E\u043D\u0435\u043D\u0442\u043E\u0432 \u0441\u0438\u0441\u0442\u0435\u043C\u044B. \u041F\u043E\u0441\u043A\u043E\u043B\u044C\u043A\u0443 \u043A\u0430\u0436\u0434\u044B\u0439 \u043D\u0430\u0431\u043E\u0440 \u043F\u0440\u0435\u0434\u0441\u0442\u0430\u0432\u043B\u0435\u043D \u0444\u0443\u043D\u043A\u0446\u0438\u0435\u0439, \u0435\u0433\u043E \u0438\u043C\u044F \u043C\u043E\u0436\u0435\u0442 \u0441\u043E\u0434\u0435\u0440\u0436\u0430\u0442\u044C \u0442\u043E\u043B\u044C\u043A\u043E \u0431\u0443\u043A\u0432\u044B, \u0447\u0438\u0441\u043B\u0430 \u0438 \u043D\u0438\u0436\u043D\u0438\u0435 \u043F\u043E\u0434\u0447\u0435\u0440\u043A\u0438\u0432\u0430\u043D\u0438\u044F.

ruleSetResult = \u041A\u043E\u043D\u0435\u0447\u043D\u044B\u0439 \u0440\u0435\u0437\u0443\u043B\u044C\u0442\u0430\u0442 \u043D\u0430\u0431\u043E\u0440\u0430 \u043F\u0440\u0430\u0432\u0438\u043B

ruleSetResultUndefined = \u0420\u0435\u0437\u0443\u043B\u044C\u0442\u0430\u0442 \u043E\u0431\u0440\u0430\u0431\u043E\u0442\u043A\u0438 \u043D\u0430\u0431\u043E\u0440\u0430 \u043F\u0440\u0430\u0432\u0438\u043B \u043D\u0435 \u043E\u043F\u0440\u0435\u0434\u0435\u043B\u0435\u043D

ruleSetRulesCommentHelp = \u041B\u044E\u0431\u044B\u0435 \u0437\u0430\u043C\u0435\u0442\u043A\u0438 \u043E \u043D\u0430\u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0438 \u043F\u0440\u0430\u0432\u0438\u043B\u0430.

ruleSetRulesConditionHelp = \u041E\u043F\u0446\u0438\u043E\u043D\u0430\u043B\u044C\u043D\u043E\u0435 \u0432\u044B\u0440\u0430\u0436\u0435\u043D\u0438\u0435, \u0440\u0435\u0437\u0443\u043B\u044C\u0442\u0430\u0442 \u043A\u043E\u0442\u043E\u0440\u043E\u0433\u043E \u0434\u043E\u043B\u0436\u0435\u043D \u0438\u043C\u0435\u0442\u044C \u043B\u043E\u0433\u0438\u0447\u0435\u0441\u043A\u0438\u0439 \u0442\u0438\u043F, \u0442.\u0435. true \u0438\u043B\u0438 false. \u0412\u044B\u0447\u0438\u0441\u043B\u0435\u043D\u0438\u0435 \u0432\u044B\u0440\u0430\u0436\u0435\u043D\u0438\u044F \u043F\u0440\u0430\u0432\u0438\u043B\u0430 \u043F\u0440\u043E\u043F\u0443\u0441\u043A\u0430\u0435\u0442\u0441\u044F, \u0435\u0441\u043B\u0438 \u0440\u0435\u0437\u0443\u043B\u044C\u0442\u0430\u0442 \u0432\u044B\u0447\u0438\u0441\u043B\u0435\u043D\u0438\u044F \u0432\u044B\u0440\u0430\u0436\u0435\u043D\u0438\u044F \u0443\u0441\u043B\u043E\u0432\u0438\u044F false.

ruleSetRulesExpressionHelp = \u0420\u0435\u0437\u0443\u043B\u044C\u0442\u0430\u0442 \u0432\u044B\u0447\u0438\u0441\u043B\u0435\u043D\u0438\u044F \u0432\u044B\u0440\u0430\u0436\u0435\u043D\u0438\u044F \u0437\u0430\u043F\u0438\u0441\u044B\u0432\u0430\u0435\u0442\u0441\u044F \u0432 '\u0426\u0435\u043B\u044C'.

ruleSetRulesHelp = \u0414\u0430\u043D\u043D\u043E\u0435 \u043F\u043E\u043B\u0435 \u043E\u043F\u0440\u0435\u0434\u0435\u043B\u044F\u0435\u0442 \u0441\u043F\u0438\u0441\u043E\u043A \u043F\u0440\u0430\u0432\u0438\u043B.

ruleSetRulesTargetHelp = \u041C\u043E\u0436\u0435\u0442 \u0431\u044B\u0442\u044C \u043A\u0430\u043A '\u041A\u043E\u043D\u0435\u0447\u043D\u044B\u043C \u0440\u0435\u0437\u0443\u043B\u044C\u0442\u0430\u0442\u043E\u043C \u043D\u0430\u0431\u043E\u0440\u0430 \u043F\u0440\u0430\u0432\u0438\u043B' (\u0442.\u0435. \u0440\u0435\u0437\u0443\u043B\u044C\u0442\u0430\u0442\u043E\u043C \u0432\u0441\u0435\u0433\u043E \u043D\u0430\u0431\u043E\u0440\u0430 \u043F\u0440\u0430\u0432\u0438\u043B), \u0442\u0430\u043A \u0438 \u0438\u043C\u0435\u043D\u0435\u043C \u043F\u0435\u0440\u0435\u043C\u0435\u043D\u043D\u043E\u0439 \u0441\u0440\u0435\u0434\u044B \u043D\u0430\u0431\u043E\u0440\u0430 \u043F\u0440\u0430\u0432\u0438\u043B, \u043A\u043E\u0442\u043E\u0440\u043E\u0435 \u043E\u043F\u0440\u0435\u0434\u0435\u043B\u044F\u0435\u0442\u0441\u044F \u0438\u043B\u0438 \u043F\u043E\u0432\u0442\u043E\u0440\u043D\u043E \u043E\u043F\u0440\u0435\u0434\u0435\u043B\u044F\u0435\u0442\u0441\u044F \u043F\u0440\u0430\u0432\u0438\u043B\u043E\u043C.

ruleSetTypeDependent = \u041E\u0442\u0441\u043B\u0435\u0436\u0438\u0432\u0430\u043D\u0438\u0435 \u0437\u0430\u0432\u0438\u0441\u0438\u043C\u043E\u0441\u0442\u0435\u0439

ruleSetTypeHelp = \u0414\u0430\u043D\u043D\u043E\u0435 \u043F\u043E\u043B\u0435 \u043E\u043F\u0440\u0435\u0434\u0435\u043B\u044F\u0435\u0442 \u0442\u0438\u043F \u043D\u0430\u0431\u043E\u0440\u0430 \u043F\u0440\u0430\u0432\u0438\u043B: \u041F\u043E\u0441\u043B\u0435\u0434\u043E\u0432\u0430\u0442\u0435\u043B\u044C\u043D\u0430\u044F \u043E\u0431\u0440\u0430\u0431\u043E\u0442\u043A\u0430 \u0438\u043B\u0438 \u041E\u0442\u0441\u043B\u0435\u0436\u0438\u0432\u0430\u043D\u0438\u0435 \u0437\u0430\u0432\u0438\u0441\u0438\u043C\u043E\u0441\u0442\u0438.

ruleSetTypeSequential = \u041F\u043E\u0441\u043B\u0435\u0434\u043E\u0432\u0430\u0442\u0435\u043B\u044C\u043D\u0430\u044F \u043E\u0431\u0440\u0430\u0431\u043E\u0442\u043A\u0430

ruleSetVarNotDefined = \u041F\u0435\u0440\u0435\u043C\u0435\u043D\u043D\u0430\u044F \u043D\u0430\u0431\u043E\u0440\u0430 \u043F\u0440\u0430\u0432\u0438\u043B \u043D\u0435 \u043E\u043F\u0440\u0435\u0434\u0435\u043B\u0435\u043D\u0430:

ruleSets = \u041D\u0430\u0431\u043E\u0440\u044B \u043F\u0440\u0430\u0432\u0438\u043B

ruleSetsHelp = \u0422\u0430\u0431\u043B\u0438\u0446\u0430 \u043D\u0430\u0431\u043E\u0440\u043E\u0432 \u043F\u0440\u0430\u0432\u0438\u043B \u043E\u043F\u0440\u0435\u0434\u0435\u043B\u044F\u0435\u0442 \u043D\u0430\u0431\u043E\u0440\u044B \u0431\u0438\u0437\u043D\u0435\u0441-\u043F\u0440\u0430\u0432\u0438\u043B, \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u0443\u0435\u043C\u044B\u0435 \u043C\u043E\u0434\u0435\u043B\u044C\u044E.

serverCachingMode = \u041A\u044D\u0448\u0438\u0440\u043E\u0432\u0430\u043D\u0438\u0435 \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0439 \u0432 \u043F\u0430\u043C\u044F\u0442\u0438 \u0441\u0435\u0440\u0432\u0435\u0440\u0430

serverCachingModeHard = \u0425\u0440\u0430\u043D\u0438\u0442\u044C \u0432\u0441\u0435\u0433\u0434\u0430

serverCachingModeHelp = \u0423\u043F\u0440\u0430\u0432\u043B\u044F\u0435\u0442 \u043A\u044D\u0448\u0438\u0440\u043E\u0432\u0430\u043D\u0438\u0435\u043C \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0439 \u043D\u0430 \u0441\u0442\u043E\u0440\u043E\u043D\u0435 \u0441\u0435\u0440\u0432\u0435\u0440\u0430. \u0425\u0440\u0430\u043D\u0438\u0442\u044C \u0432\u0441\u0435\u0433\u0434\u0430 - \u0432 \u043A\u044D\u0448 \u0432\u0441\u0435\u0433\u0434\u0430 \u0431\u0443\u0434\u0435\u0442 \u043F\u043E\u043C\u0435\u0449\u0430\u0442\u044C\u0441\u044F \u043F\u043E\u0441\u043B\u0435\u0434\u043D\u0435\u0435 \u0437\u0430\u043F\u0438\u0441\u0430\u043D\u043D\u043E\u0435 \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435. \u0425\u0440\u0430\u043D\u0438\u0442\u044C, \u0435\u0441\u043B\u0438 \u0435\u0441\u0442\u044C \u043C\u0435\u0441\u0442\u043E \u0432 \u043F\u0430\u043C\u044F\u0442\u0438 - \u0432 \u043A\u044D\u0448 \u0437\u0430\u043F\u0438\u0441\u0430\u043D\u043D\u043E\u0435 \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435 \u0431\u0443\u0434\u0435\u0442 \u043F\u043E\u043C\u0435\u0449\u0430\u0442\u044C\u0441\u044F \u0442\u043E\u043B\u044C\u043A\u043E \u043F\u0440\u0438 \u043D\u0430\u043B\u0438\u0447\u0438\u0438 \u0441\u0432\u043E\u0431\u043E\u0434\u043D\u043E\u0439 \u043F\u0430\u043C\u044F\u0442\u0438.

serverCachingModeSoft = \u0425\u0440\u0430\u043D\u0438\u0442\u044C, \u0435\u0441\u043B\u0438 \u0435\u0441\u0442\u044C \u043C\u0435\u0441\u0442\u043E \u0432 \u043F\u0430\u043C\u044F\u0442\u0438

storageMode = \u0420\u0435\u0436\u0438\u043C \u0445\u0440\u0430\u043D\u0435\u043D\u0438\u044F

variableDescriptionHelp = \u0414\u0430\u043D\u043D\u043E\u0435 \u043F\u043E\u043B\u0435 \u043F\u0440\u0438\u043C\u0435\u043D\u044F\u0435\u0442\u0441\u044F \u0434\u043B\u044F \u0437\u0430\u0434\u0430\u043D\u0438\u044F \u0443\u0434\u043E\u0431\u043E\u0447\u0438\u0442\u0430\u0435\u043C\u043E\u0433\u043E \u0434\u043B\u044F \u0447\u0435\u043B\u043E\u0432\u0435\u043A\u0430 \u043E\u043F\u0438\u0441\u0430\u043D\u0438\u044F \u043F\u0435\u0440\u0435\u043C\u0435\u043D\u043D\u043E\u0439.

variableFormatHelp = \u0414\u0430\u043D\u043D\u043E\u0435 \u043F\u043E\u043B\u0435 \u0437\u0430\u0434\u0430\u0435\u0442 \u0444\u043E\u0440\u043C\u0430\u0442 \u043F\u0435\u0440\u0435\u043C\u0435\u043D\u043D\u043E\u0439.

variableGroupHelp = \u0414\u0430\u043D\u043D\u043E\u0435 \u043F\u043E\u043B\u0435 \u043E\u043F\u0440\u0435\u0434\u0435\u043B\u044F\u0435\u0442 \u043A \u043A\u0430\u043A\u043E\u0439 \u0433\u0440\u0443\u043F\u043F\u0435 \u043E\u0442\u043D\u043E\u0441\u0438\u0442\u0441\u044F \u0442\u0435\u043A\u0443\u0449\u0430\u044F \u043F\u0435\u0440\u0435\u043C\u0435\u043D\u043D\u0430\u044F. \u041C\u043E\u0436\u0435\u0442 \u0431\u044B\u0442\u044C NULL, \u0435\u0441\u043B\u0438 \u043F\u0435\u0440\u0435\u043C\u0435\u043D\u043D\u0430\u044F \u043D\u0435 \u0432\u0445\u043E\u0434\u0438\u0442 \u0432 \u043A\u0430\u043A\u0443\u044E-\u043B\u0438\u0431\u043E \u0433\u0440\u0443\u043F\u043F\u0443.

variableHelp = \u0414\u0430\u043D\u043D\u043E\u0435 \u0441\u0432\u043E\u0439\u0441\u0442\u0432\u043E \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u0443\u0435\u0442\u0441\u044F \u0434\u043B\u044F \u043E\u0431\u044A\u044F\u0432\u043B\u0435\u043D\u0438\u044F \u043F\u0435\u0440\u0435\u043C\u0435\u043D\u043D\u044B\u0445 \u0432 \u043C\u043E\u0434\u0435\u043B\u0438.

variableHelpHelp = \u0414\u0430\u043D\u043D\u043E\u0435 \u043F\u043E\u043B\u0435 \u0438\u0441\u043F\u043E\u043B\u044C\u0437\u0443\u0435\u0442\u0441\u044F \u0434\u043B\u044F \u0437\u0430\u0434\u0430\u043D\u0438\u044F \u043F\u043E\u0434\u0440\u043E\u0431\u043D\u043E\u0433\u043E \u043E\u043F\u0438\u0441\u0430\u043D\u0438\u044F \u043F\u0435\u0440\u0435\u043C\u0435\u043D\u043D\u043E\u0439.

variableHistoryRateHelp = \u0420\u0435\u0436\u0438\u043C \u0437\u0430\u043F\u0438\u0441\u0438 \u0438\u0441\u0442\u043E\u0440\u0438\u0438 \u0443\u043F\u0440\u0430\u0432\u043B\u044F\u0435\u0442 \u043F\u043E\u043B\u0438\u0442\u0438\u043A\u043E\u0439 \u0441\u043E\u0445\u0440\u0430\u043D\u0435\u043D\u0438\u044F \u0438\u0441\u0442\u043E\u0440\u0438\u0438 \u0438 \u043E\u043F\u043E\u0432\u0435\u0449\u0435\u043D\u0438\u0439 \u043E\u0431 \u043E\u0431\u043D\u043E\u0432\u043B\u0435\u043D\u0438\u044F\u0445. \u041F\u0440\u0438 \u0440\u0435\u0436\u0438\u043C\u0435 '\u0422\u043E\u043B\u044C\u043A\u043E \u0438\u0437\u043C\u0435\u043D\u0435\u043D\u0438\u044F' \u0443\u0441\u0442\u0430\u043D\u043E\u0432\u043A\u0430 \u0442\u043E\u0433\u043E \u0436\u0435 \u0441\u0430\u043C\u043E\u0433\u043E \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u044F \u0432 \u043F\u0435\u0440\u0435\u043C\u0435\u043D\u043D\u0443\u044E \u0431\u0443\u0434\u0435\u0442 \u0438\u0433\u043D\u043E\u0440\u0438\u0440\u043E\u0432\u0430\u0442\u044C\u0441\u044F. \u041F\u0440\u0438 \u0440\u0435\u0436\u0438\u043C\u0435 '\u0412\u0441\u0435 \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u044F' \u043B\u044E\u0431\u0430\u044F \u043E\u043F\u0435\u0440\u0430\u0446\u0438\u044F \u0437\u0430\u043F\u0438\u0441\u0438 \u0432 \u044D\u0442\u0443 \u043F\u0435\u0440\u0435\u043C\u0435\u043D\u043D\u0443\u044E \u0431\u0443\u0434\u0435\u0442 \u0441\u043E\u0445\u0440\u0430\u043D\u044F\u0442\u044C\u0441\u044F \u0432 \u0438\u0441\u0442\u043E\u0440\u0438\u0438 \u0438 \u043A\u0430\u0436\u0434\u044B\u0439 \u0440\u0430\u0437 \u0431\u0443\u0434\u0435\u0442 \u0432\u044B\u0437\u044B\u0432\u0430\u0442\u044C\u0441\u044F \u043E\u043F\u043E\u0432\u0435\u0449\u0435\u043D\u0438\u0435 \u043E\u0431 \u043E\u0431\u043D\u043E\u0432\u043B\u0435\u043D\u0438\u0438.

variableHistoryStorageTimeHelp = \u0414\u0430\u043D\u043D\u043E\u0435 \u043F\u043E\u043B\u0435 \u043E\u043F\u0440\u0435\u0434\u0435\u043B\u044F\u0435\u0442, \u043A\u0430\u043A \u0434\u043E\u043B\u0433\u043E \u0445\u0440\u0430\u043D\u044F\u0442\u0441\u044F \u0440\u0430\u043D\u0435\u0435 \u0437\u0430\u0444\u0438\u043A\u0441\u0438\u0440\u043E\u0432\u0430\u043D\u043D\u044B\u0435 \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u044F \u044D\u0442\u043E\u0439 \u043F\u0435\u0440\u0435\u043C\u0435\u043D\u043D\u043E\u0439.

variableNameHelp = \u0414\u0430\u043D\u043D\u043E\u0435 \u043F\u043E\u043B\u0435 \u043E\u043F\u0440\u0435\u0434\u0435\u043B\u044F\u0435\u0442 \u0438\u043C\u044F \u043F\u0435\u0440\u0435\u043C\u0435\u043D\u043D\u043E\u0439.

variableReadPermissionsHelp = \u0414\u0430\u043D\u043D\u043E\u0435 \u043F\u043E\u043B\u0435 \u043E\u043F\u0440\u0435\u0434\u0435\u043B\u044F\u0435\u0442 \u0443\u0440\u043E\u0432\u0435\u043D\u044C \u043F\u0440\u0430\u0432 \u0434\u043E\u0441\u0442\u0443\u043F\u0430 \u0432 \u043A\u043E\u043D\u0442\u0435\u043A\u0441\u0442\u0435 \u043C\u043E\u0434\u0435\u043B\u0438 (\u043B\u0438\u0431\u043E \u043A\u043E\u043D\u0442\u0435\u043A\u0441\u0442, \u043A \u043A\u043E\u0442\u043E\u0440\u043E\u043C\u0443 \u043F\u0440\u0438\u043A\u0440\u0435\u043F\u043B\u044F\u0435\u0442\u0441\u044F \u043E\u0442\u043D\u043E\u0441\u0438\u0442\u0435\u043B\u044C\u043D\u0430\u044F \u043C\u043E\u0434\u0435\u043B\u044C, \u043B\u0438\u0431\u043E \u043A\u043E\u043D\u0442\u0435\u043A\u0441\u0442 \u044D\u043A\u0437\u0435\u043C\u043F\u043B\u044F\u0440\u0430 \u044D\u043A\u0437\u0435\u043C\u043F\u043B\u044F\u0440\u043D\u043E\u0439 \u043C\u043E\u0434\u0435\u043B\u0438), \u043D\u0435\u043E\u0431\u0445\u043E\u0434\u0438\u043C\u044B\u0439 \u0434\u043B\u044F \u0447\u0442\u0435\u043D\u0438\u044F \u043F\u0435\u0440\u0435\u043C\u0435\u043D\u043D\u043E\u0439.

variableStorageModeHelp = \u0414\u0430\u043D\u043D\u043E\u0435 \u043F\u043E\u043B\u0435 \u043E\u043F\u0440\u0435\u0434\u0435\u043B\u044F\u0435\u0442, \u043F\u043E\u0441\u0442\u043E\u044F\u043D\u043D\u043E \u043B\u0438 \u0437\u043D\u0430\u0447\u0435\u043D\u0438\u0435 \u043F\u0435\u0440\u0435\u043C\u0435\u043D\u043D\u043E\u0439 (\u0442\u0438\u043F \u0445\u0440\u0430\u043D\u0435\u043D\u0438\u044F \u0411\u0430\u0437\u0430 \u0434\u0430\u043D\u043D\u044B\u0445), \u043B\u0438\u0431\u043E \u043E\u043D\u043E \u043F\u0435\u0440\u0435\u0445\u043E\u0434\u043D\u043E\u0435 (\u0442\u0438\u043F \u0445\u0440\u0430\u043D\u0435\u043D\u0438\u044F \u041F\u0430\u043C\u044F\u0442\u044C).

variableWritableHelp = \u0424\u043B\u0430\u0433, \u0443\u043A\u0430\u0437\u044B\u0432\u0430\u044E\u0449\u0438\u0439 \u043D\u0430 \u0442\u043E, \u0447\u0442\u043E \u043F\u0435\u0440\u0435\u043C\u0435\u043D\u043D\u0430\u044F \u043F\u0435\u0440\u0435\u0437\u0430\u043F\u0438\u0441\u044B\u0432\u0430\u0435\u043C\u0430\u044F.

variableWritePermissionsHelp = \u0414\u0430\u043D\u043D\u043E\u0435 \u043F\u043E\u043B\u0435 \u043E\u043F\u0440\u0435\u0434\u0435\u043B\u044F\u0435\u0442 \u0443\u0440\u043E\u0432\u0435\u043D\u044C \u043F\u0440\u0430\u0432 \u0434\u043E\u0441\u0442\u0443\u043F\u0430 \u0432 \u043A\u043E\u043D\u0442\u0435\u043A\u0441\u0442\u0435 \u043C\u043E\u0434\u0435\u043B\u0438 (\u043B\u0438\u0431\u043E \u043A\u043E\u043D\u0442\u0435\u043A\u0441\u0442, \u043A \u043A\u043E\u0442\u043E\u0440\u043E\u043C\u0443 \u043F\u0440\u0438\u043A\u0440\u0435\u043F\u043B\u044F\u0435\u0442\u0441\u044F \u043E\u0442\u043D\u043E\u0441\u0438\u0442\u0435\u043B\u044C\u043D\u0430\u044F \u043C\u043E\u0434\u0435\u043B\u044C, \u043B\u0438\u0431\u043E \u043A\u043E\u043D\u0442\u0435\u043A\u0441\u0442 \u044D\u043A\u0437\u0435\u043C\u043F\u043B\u044F\u0440\u0430 \u044D\u043A\u0437\u0435\u043C\u043F\u043B\u044F\u0440\u043D\u043E\u0439 \u043C\u043E\u0434\u0435\u043B\u0438), \u043D\u0435\u043E\u0431\u0445\u043E\u0434\u0438\u043C\u044B\u0439 \u0434\u043B\u044F \u0437\u0430\u043F\u0438\u0441\u0438 \u043F\u0435\u0440\u0435\u043C\u0435\u043D\u043D\u043E\u0439.
