bindingExecutionRejected = Se ha rechazado la ejecuci\u00F3n de un modelo de obligaci\u00F3n. Comprobar la configuraci\u00F3n del modelo de ajustes de concurrencia del modelo de ajuste.

bindingsHelp = Esta propiedad se usa para definir obligaciones de modelos.

cacheTime = Hora de la cach\u00E9

cacheTimeHelp = Define el per\u00EDodo m\u00EDnimo de lecturas remotas sucesivas de valor variable. Si los componentes remotos intentan leer la variable dos veces durante el per\u00EDodo de la cach\u00E9, el segundo intento de lectura devolver\u00E1 el valor de la cach\u00E9. Un valor no definido desactiva la cach\u00E9.

containerName = Nombre del contenedor

containerType = Tipo de contenedor

containerTypeDescription = Descripci\u00F3n del tipo de contenedor

errCompilingFuncImpl = Se ha producido un error al compilar la implementaci\u00F3n de la funci\u00F3n ''{0}'':

errInstallingModel = No se permite instalar el contenedor de instancias del modelo en ''{0}''

eventDescriptionHelp = Este campo se utiliza para definir una descripci\u00F3n de evento de lectura humana.

eventFirePermissionsHelp = Este campo se utiliza para especificar un nivel de permiso en el contexto del modelo (o un contexto al que est\u00E1 unido el modelo relativo o un contexto de instancia del modelo instant\u00E1neo) necesario para generar una instancia de este evento.

eventFormatHelp = Este campo se utiliza para definir un formato de los datos del evento.

eventGroupHelp = Este campo define un grupo de evento. Puede ser NULO si el evento no pertenece a ning\u00FAn otro grupo.

eventHelp = Esta propiedad se usa para declarar eventos en el modelo.

eventHelpHelp = Este campo se utiliza para especificar una descripci\u00F3n detallada del evento.

eventHistoryStoragePeriodHelp = Este campo define cu\u00E1nto tiempo se conservan las instancias del historial de este evento en la base de datos del servidor. El valor cero desactiva el almacenamiento continuo del evento.

eventLevelHelp = Este campo define un nivel predeterminado del evento.

eventNameHelp = Este campo define un nombre del evento.

eventPermissionsHelp = Este campo se utiliza para especificar un nivel de permiso en el contexto del modelo (o un contexto al que est\u00E1 unido el modelo relativo o un contexto de instancia del modelo instant\u00E1neo) necesario para suscribirse a este evento.

foundMultipleRulesToCalculate = Se han encontrado m\u00FAltiples reglas activas para calcular la variable:

foundNoRulesToCalculate = Se han encontrado reglas no activas para calcular la variable:

functionDescriptionHelp = Este campo se utiliza para definir una descripci\u00F3n de funci\u00F3n de lectura humana.

functionExpressionHelp = Este campo se encuentra disponible si Tipo se establece en Expresi\u00F3n. La expresi\u00F3n se evaluar\u00E1 durante la ejecuci\u00F3n de la funci\u00F3n.

functionGroupHelp = Este campo define un grupo de funci\u00F3n. Puede ser NULO si la funci\u00F3n no pertenece a ning\u00FAn otro grupo.

functionHelp = Esta propiedad se usa para declarar funciones en el modelo.

functionHelpHelp = Este campo se utiliza para especificar una descripci\u00F3n detallada de la funci\u00F3n.

functionImplementationHelp = Este campo se encuentra disponible si Tipo se establece en C\u00F3digo Java. C\u00F3digo fuente de la clase Java que implementa el cuerpo de la funci\u00F3n, es decir, realiza algo que se supone que hace la funci\u00F3n.

functionInputFormatHelp = Este campo se utiliza para definir un formato de entrada de la funci\u00F3n.

functionNameHelp = Este campo define un nombre de la funci\u00F3n.

functionOutputFormatHelp = Este campo se utiliza para definir un formato de salida de la funci\u00F3n.

functionPermissionsHelp = Este campo define el nivel de permiso en el contexto del modelo (o un contexto al que est\u00E1 unido el modelo relativo o un contexto de instancia del modelo instant\u00E1neo) necesario para ejecutar la funci\u00F3n.

functionQueryHelp = Este campo se encuentra disponible si Tipo se establece en Consulta. La consulta se evaluar\u00E1 durante la ejecuci\u00F3n de la funci\u00F3n.

functionTypeHelp = Este campo define el tipo de implementaci\u00F3n de la funci\u00F3n.

historyStoragePeriod = Per\u00EDodo de almacenamiento del historial

instantiable = Instanciable

javaCode = C\u00F3digo Java

modelEvents = Eventos del modelo

modelFunctions = Funciones del modelo

modelGroups = Grupos del modelo

modelVariables = Variables del modelo

models = Modelos

objectType = Tipo de objeto

objectTypeDescription = Descripci\u00F3n del tipo de objeto

propertiesAdvancedBindingSettingsHelp = Ajustes de obligaci\u00F3n avanzados

propertiesConValidityExpressionHelp = Act\u00FAa de forma distinta para los tipos de modelo instanciable y relativo. Para un modelo relativo, determina los contextos a los que se debe unir el modelo. Para un modelo instanciable, determina los contextos a los que se deben unir los contenedores de instancia del modelo.

propertiesConValidityListenersHelp = Una lista de m\u00E1scaras de contexto y nombres de eventos. Si el evento especificado mediante un campo Evento de esta tabla se produce en alguno de los contextos coincidentes con la m\u00E1scara especificada en el campo M\u00E1scara en el mismo registro, la Expresi\u00F3n de validez se volver\u00E1 a calcular para este contexto. Esto permite hacer que el modelo sea v\u00E1lido o no para un determinado contexto si se producen ciertos cambios en \u00E9l.

propertiesContainerNameHelp = Esta opci\u00F3n define un nombre de contexto de contenedores de modelo. Debe cumplir las convenciones de nombres de contexto.

propertiesContainerTypeDescriptionHelp = Esta opci\u00F3n define una descripci\u00F3n de lectura humana del tipo de contexto del contenedor de modelo.

propertiesContainerTypeHelp = Esta opci\u00F3n define un tipo de contexto de los contenedores de modelo. La  cadena de tipo solo puede incluir letras del alfabeto ingl\u00E9s, n\u00FAmeros y guiones bajos.

propertiesDescriptionHelp = Descripci\u00F3n de texto del contexto del modelo.

propertiesEnabledHelp = Si este indicador est\u00E1 desmarcado, el modelo est\u00E1 desactivado y no se realiza ning\u00FAn tipo de procesamiento activo de obligaci\u00F3n. Sin embargo, todas las definiciones de eventos, funciones y variables a\u00F1adidas por este modelo siguen estando disponibles si el modelo est\u00E1 desactivado. Las instancias de un modelo instanciable tampoco se ocultan ni se eliminan del \u00E1rbol de contexto del servidor.

propertiesHelp = Esta propiedad define las opciones b\u00E1sicas para un modelo.\t

propertiesInstantiableModelSettingsGroupHelp = Ajustes del modelo instanciable

propertiesLogBindingsExecutionHelp = Esta opci\u00F3n activa y desactiva el registro de todas las obligaciones ejecutadas.

propertiesMaximumBindingQueueLengthHelp = Esta opci\u00F3n define cu\u00E1ntas operaciones de obligaciones no procesadas se pueden poner en cola antes de que el tama\u00F1o de la reserva de subprocesos del modelo aumente por encima del tama\u00F1o del n\u00FAcleo hasta su tama\u00F1o m\u00E1ximo.

propertiesMaximumConcurrentBindingsHelp = Esta opci\u00F3n define el tama\u00F1o m\u00E1ximo de la reserva de subprocesos del modelo, es decir, el n\u00FAmero de obligaciones procesadas simult\u00E1neamente permitidas en caso de desbordamiento de la cola de obligaciones.

propertiesNameHelp = Nombre del contexto del modelo. Debe cumplir las convenciones de nombres de contexto. El nombre es necesario para referirse a este modelo desde otras partes del sistema.

propertiesNormalConcurrentBindingsHelp = Esta opci\u00F3n define el tama\u00F1o del n\u00FAcleo de la reserva de subprocesos del modelo, es decir, el n\u00FAmero base de obligaciones que se procesar\u00E1n de forma simult\u00E1nea.

propertiesObjectTypeDescriptionHelp = Esta opci\u00F3n es \u00FAnicamente aplicable a modelos instanciables. Esto define una descripci\u00F3n de lectura humana del tipo de contexto de la instancia del modelo.

propertiesObjectTypeHelp = Esta opci\u00F3n es \u00FAnicamente aplicable a modelos instanciables. Esto define un tipo de contexto de las instancias del modelo. La cadena de tipo solo puede incluir letras del alfabeto ingl\u00E9s, n\u00FAmeros y guiones bajos.

propertiesTypeHelp = Esta opci\u00F3n especifica el tipo de modelo. Existen 3 tipos: Relativo, Absoluto o Instanciable.

propertiesValidityGroupHelp = Validez

ruleSetDescriptionHelp = Esta opci\u00F3n define una descripci\u00F3n de lectura humana del conjunto de reglas.

ruleSetNameHelp = Este campo define un nombre de un conjunto de reglas. Se usa para referirse a este conjunto desde otros componentes del sistema. Dado que cada conjunto est\u00E1 representado por una funci\u00F3n, su nombre solo puede contener letras, n\u00FAmeros y guiones bajos.

ruleSetResult = Resultado del conjunto de reglas final

ruleSetResultUndefined = El resultado del procesamiento del conjunto de reglas no se ha definido.

ruleSetRulesCommentHelp = Todas las notas acerca del prop\u00F3sito de las reglas

ruleSetRulesConditionHelp = Una expresi\u00F3n opcional que debe dar como resultado un valor booleano. La evaluaci\u00F3n de la regla se omite si el resultado de la expresi\u00F3n de la condici\u00F3n es falso.

ruleSetRulesExpressionHelp = Un resultado de una evaluaci\u00F3n de la expresi\u00F3n se escribe en el destino.

ruleSetRulesHelp = Este campo especifica la lista de reglas.

ruleSetRulesTargetHelp = Puede ser tanto el resultado del conjunto de reglas finales (es decir, el resultado del conjunto de reglas total) o el nombre de una variable del entorno del conjunto de reglas que ser\u00E1 definido o redefinido por la regla.

ruleSetTypeDependent = Seguimiento de dependencia

ruleSetTypeHelp = Este campo define el tipo de conjunto de reglas: Procesamiento secuencial o seguimiento de dependencia

ruleSetTypeSequential = Procesamiento secuencial

ruleSetVarNotDefined = Variable del conjunto de reglas no definida:

ruleSets = Conjuntos de reglas

ruleSetsHelp = La tabla de los conjuntos de reglas define los conjuntos de reglas empresariales utilizados por el modelo.

storageMode = Modo de almacenamiento

variableDescriptionHelp = Este campo se utiliza para definir una descripci\u00F3n de variable de lectura humana.

variableFormatHelp = Este campo define un formato de la variable.

variableGroupHelp = Este campo define un grupo de variable. Puede ser NULO si la variable no pertenece a ning\u00FAn otro grupo.

variableHelp = Esta propiedad se usa para declarar variables en el modelo.

variableHelpHelp = Este campo se utiliza para especificar una descripci\u00F3n detallada de la variable.

variableHistoryStorageTimeHelp = Este campo define cu\u00E1nto tiempo se conservan los valores del historial de esta variable en la base de datos del servidor.

variableNameHelp = Este campo define un nombre de la variable.

variableReadPermissionsHelp = Este campo especifica un nivel de permiso en el contexto del modelo (o un contexto al que est\u00E1 unido el modelo relativo o un contexto de instancia del modelo instanciable) necesario para leer la variable.

variableStorageModeHelp = Este campo define si el valor de la variable es continuo (tipo de almacenamiento de la base de datos) o transitorio (tipo de almacenamiento de memoria).

variableWritableHelp = Indicador que se\u00F1ala que la variable tiene permiso de escritura.

variableWritePermissionsHelp = Este campo especifica un nivel de permiso en el contexto del modelo (o un contexto al que est\u00E1 unido el modelo relativo o un contexto de instancia del modelo instanciable) necesario para escribir la variable.
